Public Attributes | List of all members
API_AnalyticalEdgeLoadType Struct Reference
Analytical Model
Describes a Structural Analytical Model Member Edge Load. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalEdgeLoad_Settings  | analyticalEdgeLoadSettings
Describes the Structural Analytical Model Analytical Edge Load settings.
 API_AnalyticalMemberPartRef  | loadedMemberPartRef
The Analytical Member part reference where the Analytical Edge Load is applied.
Detailed Description
Describes a Structural Analytical Model Member Edge Load.
Since
Archicad 25
Remarks
An Edge Load element can be created with the aid of ACAPI_Element_Create and it can be removed via the ACAPI_Element_Delete function. Currently the ACAPI_Element_Change function is unavailable for Analytical Edge Loads.